aehoppe/E70N19_Dev_Board/atsame70n19/include/component/isi.h
/* -------- ISI_CR : (ISI Offset: 0x24) (/W 32) ISI Control Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ISI_EN:1;                  /**< bit:      0  ISI Module Enable Request                */
    uint32_t ISI_DIS:1;                 /**< bit:      1  ISI Module Disable Request               */
    uint32_t ISI_SRST:1;                /**< bit:      2  ISI Software Reset Request               */
    uint32_t :5;                        /**< bit:   3..7  Reserved */
    uint32_t ISI_CDC:1;                 /**< bit:      8  ISI Codec Request                        */
    uint32_t :23;                       /**< bit:  9..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_CR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_CR_OFFSET                       (0x24)                                        /**<  (ISI_CR) ISI Control Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define ISI_CR_ISI_EN_Pos                   0                                              /**< (ISI_CR) ISI Module Enable Request Position */
#define ISI_CR_ISI_EN_Msk                   (0x1U << ISI_CR_ISI_EN_Pos)                    /**< (ISI_CR) ISI Module Enable Request Mask */
#define ISI_CR_ISI_EN                       ISI_CR_ISI_EN_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CR_ISI_EN_Msk instead */
#define ISI_CR_ISI_DIS_Pos                  1                                              /**< (ISI_CR) ISI Module Disable Request Position */
#define ISI_CR_ISI_DIS_Msk                  (0x1U << ISI_CR_ISI_DIS_Pos)                   /**< (ISI_CR) ISI Module Disable Request Mask */
#define ISI_CR_ISI_DIS                      ISI_CR_ISI_DIS_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CR_ISI_DIS_Msk instead */
#define ISI_CR_ISI_SRST_Pos                 2                                              /**< (ISI_CR) ISI Software Reset Request Position */
#define ISI_CR_ISI_SRST_Msk                 (0x1U << ISI_CR_ISI_SRST_Pos)                  /**< (ISI_CR) ISI Software Reset Request Mask */
#define ISI_CR_ISI_SRST                     ISI_CR_ISI_SRST_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CR_ISI_SRST_Msk instead */
#define ISI_CR_ISI_CDC_Pos                  8                                              /**< (ISI_CR) ISI Codec Request Position */
#define ISI_CR_ISI_CDC_Msk                  (0x1U << ISI_CR_ISI_CDC_Pos)                   /**< (ISI_CR) ISI Codec Request Mask */
#define ISI_CR_ISI_CDC                      ISI_CR_ISI_CDC_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_CR_ISI_CDC_Msk instead */
#define ISI_CR_MASK                         (0x107U)                                       /**< \deprecated (ISI_CR) Register MASK  (Use ISI_CR_Msk instead)  */
#define ISI_CR_Msk                          (0x107U)                                       /**< (ISI_CR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- ISI_SR : (ISI Offset: 0x28) (R/ 32) ISI Status Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ENABLE:1;                  /**< bit:      0  Module Enable                            */
    uint32_t DIS_DONE:1;                /**< bit:      1  Module Disable Request has Terminated (cleared on read) */
    uint32_t SRST:1;                    /**< bit:      2  Module Software Reset Request has Terminated (cleared on read) */
    uint32_t :5;                        /**< bit:   3..7  Reserved */
    uint32_t CDC_PND:1;                 /**< bit:      8  Pending Codec Request                    */
    uint32_t :1;                        /**< bit:      9  Reserved */
    uint32_t VSYNC:1;                   /**< bit:     10  Vertical Synchronization (cleared on read) */
    uint32_t :5;                        /**< bit: 11..15  Reserved */
    uint32_t PXFR_DONE:1;               /**< bit:     16  Preview DMA Transfer has Terminated (cleared on read) */
    uint32_t CXFR_DONE:1;               /**< bit:     17  Codec DMA Transfer has Terminated (cleared on read) */
    uint32_t :1;                        /**< bit:     18  Reserved */
    uint32_t SIP:1;                     /**< bit:     19  Synchronization in Progress              */
    uint32_t :4;                        /**< bit: 20..23  Reserved */
    uint32_t P_OVR:1;                   /**< bit:     24  Preview Datapath Overflow (cleared on read) */
    uint32_t C_OVR:1;                   /**< bit:     25  Codec Datapath Overflow (cleared on read) */
    uint32_t CRC_ERR:1;                 /**< bit:     26  CRC Synchronization Error (cleared on read) */
    uint32_t FR_OVR:1;                  /**< bit:     27  Frame Rate Overrun (cleared on read)     */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_SR_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_SR_OFFSET                       (0x28)                                        /**<  (ISI_SR) ISI Status Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define ISI_SR_ENABLE_Pos                   0                                              /**< (ISI_SR) Module Enable Position */
#define ISI_SR_ENABLE_Msk                   (0x1U << ISI_SR_ENABLE_Pos)                    /**< (ISI_SR) Module Enable Mask */
#define ISI_SR_ENABLE                       ISI_SR_ENABLE_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_ENABLE_Msk instead */
#define ISI_SR_DIS_DONE_Pos                 1                                              /**< (ISI_SR) Module Disable Request has Terminated (cleared on read) Position */
#define ISI_SR_DIS_DONE_Msk                 (0x1U << ISI_SR_DIS_DONE_Pos)                  /**< (ISI_SR) Module Disable Request has Terminated (cleared on read) Mask */
#define ISI_SR_DIS_DONE                     ISI_SR_DIS_DONE_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_DIS_DONE_Msk instead */
#define ISI_SR_SRST_Pos                     2                                              /**< (ISI_SR) Module Software Reset Request has Terminated (cleared on read) Position */
#define ISI_SR_SRST_Msk                     (0x1U << ISI_SR_SRST_Pos)                      /**< (ISI_SR) Module Software Reset Request has Terminated (cleared on read) Mask */
#define ISI_SR_SRST                         ISI_SR_SRST_Msk                                /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_SRST_Msk instead */
#define ISI_SR_CDC_PND_Pos                  8                                              /**< (ISI_SR) Pending Codec Request Position */
#define ISI_SR_CDC_PND_Msk                  (0x1U << ISI_SR_CDC_PND_Pos)                   /**< (ISI_SR) Pending Codec Request Mask */
#define ISI_SR_CDC_PND                      ISI_SR_CDC_PND_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_CDC_PND_Msk instead */
#define ISI_SR_VSYNC_Pos                    10                                             /**< (ISI_SR) Vertical Synchronization (cleared on read) Position */
#define ISI_SR_VSYNC_Msk                    (0x1U << ISI_SR_VSYNC_Pos)                     /**< (ISI_SR) Vertical Synchronization (cleared on read) Mask */
#define ISI_SR_VSYNC                        ISI_SR_VSYNC_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_VSYNC_Msk instead */
#define ISI_SR_PXFR_DONE_Pos                16                                             /**< (ISI_SR) Preview DMA Transfer has Terminated (cleared on read) Position */
#define ISI_SR_PXFR_DONE_Msk                (0x1U << ISI_SR_PXFR_DONE_Pos)                 /**< (ISI_SR) Preview DMA Transfer has Terminated (cleared on read) Mask */
#define ISI_SR_PXFR_DONE                    ISI_SR_PXFR_DONE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_PXFR_DONE_Msk instead */
#define ISI_SR_CXFR_DONE_Pos                17                                             /**< (ISI_SR) Codec DMA Transfer has Terminated (cleared on read) Position */
#define ISI_SR_CXFR_DONE_Msk                (0x1U << ISI_SR_CXFR_DONE_Pos)                 /**< (ISI_SR) Codec DMA Transfer has Terminated (cleared on read) Mask */
#define ISI_SR_CXFR_DONE                    ISI_SR_CXFR_DONE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_CXFR_DONE_Msk instead */
#define ISI_SR_SIP_Pos                      19                                             /**< (ISI_SR) Synchronization in Progress Position */
#define ISI_SR_SIP_Msk                      (0x1U << ISI_SR_SIP_Pos)                       /**< (ISI_SR) Synchronization in Progress Mask */
#define ISI_SR_SIP                          ISI_SR_SIP_Msk                                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_SIP_Msk instead */
#define ISI_SR_P_OVR_Pos                    24                                             /**< (ISI_SR) Preview Datapath Overflow (cleared on read) Position */
#define ISI_SR_P_OVR_Msk                    (0x1U << ISI_SR_P_OVR_Pos)                     /**< (ISI_SR) Preview Datapath Overflow (cleared on read) Mask */
#define ISI_SR_P_OVR                        ISI_SR_P_OVR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_P_OVR_Msk instead */
#define ISI_SR_C_OVR_Pos                    25                                             /**< (ISI_SR) Codec Datapath Overflow (cleared on read) Position */
#define ISI_SR_C_OVR_Msk                    (0x1U << ISI_SR_C_OVR_Pos)                     /**< (ISI_SR) Codec Datapath Overflow (cleared on read) Mask */
#define ISI_SR_C_OVR                        ISI_SR_C_OVR_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_C_OVR_Msk instead */
#define ISI_SR_CRC_ERR_Pos                  26                                             /**< (ISI_SR) CRC Synchronization Error (cleared on read) Position */
#define ISI_SR_CRC_ERR_Msk                  (0x1U << ISI_SR_CRC_ERR_Pos)                   /**< (ISI_SR) CRC Synchronization Error (cleared on read) Mask */
#define ISI_SR_CRC_ERR                      ISI_SR_CRC_ERR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_CRC_ERR_Msk instead */
#define ISI_SR_FR_OVR_Pos                   27                                             /**< (ISI_SR) Frame Rate Overrun (cleared on read) Position */
#define ISI_SR_FR_OVR_Msk                   (0x1U << ISI_SR_FR_OVR_Pos)                    /**< (ISI_SR) Frame Rate Overrun (cleared on read) Mask */
#define ISI_SR_FR_OVR                       ISI_SR_FR_OVR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_SR_FR_OVR_Msk instead */
#define ISI_SR_MASK                         (0xF0B0507U)                                   /**< \deprecated (ISI_SR) Register MASK  (Use ISI_SR_Msk instead)  */
#define ISI_SR_Msk                          (0xF0B0507U)                                   /**< (ISI_SR) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- ISI_IER : (ISI Offset: 0x2c) (/W 32) ISI Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t DIS_DONE:1;                /**< bit:      1  Disable Done Interrupt Enable            */
    uint32_t SRST:1;                    /**< bit:      2  Software Reset Interrupt Enable          */
    uint32_t :7;                        /**< bit:   3..9  Reserved */
    uint32_t VSYNC:1;                   /**< bit:     10  Vertical Synchronization Interrupt Enable */
    uint32_t :5;                        /**< bit: 11..15  Reserved */
    uint32_t PXFR_DONE:1;               /**< bit:     16  Preview DMA Transfer Done Interrupt Enable */
    uint32_t CXFR_DONE:1;               /**< bit:     17  Codec DMA Transfer Done Interrupt Enable */
    uint32_t :6;                        /**< bit: 18..23  Reserved */
    uint32_t P_OVR:1;                   /**< bit:     24  Preview Datapath Overflow Interrupt Enable */
    uint32_t C_OVR:1;                   /**< bit:     25  Codec Datapath Overflow Interrupt Enable */
    uint32_t CRC_ERR:1;                 /**< bit:     26  Embedded Synchronization CRC Error Interrupt Enable */
    uint32_t FR_OVR:1;                  /**< bit:     27  Frame Rate Overflow Interrupt Enable     */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_IER_Type;
