aehoppe/E70N19_Dev_Board/atsame70n19/include/component/isi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_IER_OFFSET                      (0x2C)                                        /**<  (ISI_IER) ISI Interrupt Enable Register  Offset */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))

#define ISI_IER_DIS_DONE_Pos                1                                              /**< (ISI_IER) Disable Done Interrupt Enable Position */
#define ISI_IER_DIS_DONE_Msk                (0x1U << ISI_IER_DIS_DONE_Pos)                 /**< (ISI_IER) Disable Done Interrupt Enable Mask */
#define ISI_IER_DIS_DONE                    ISI_IER_DIS_DONE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IER_DIS_DONE_Msk instead */
#define ISI_IER_SRST_Pos                    2                                              /**< (ISI_IER) Software Reset Interrupt Enable Position */
#define ISI_IER_SRST_Msk                    (0x1U << ISI_IER_SRST_Pos)                     /**< (ISI_IER) Software Reset Interrupt Enable Mask */
#define ISI_IER_SRST                        ISI_IER_SRST_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IER_SRST_Msk instead */
#define ISI_IER_VSYNC_Pos                   10                                             /**< (ISI_IER) Vertical Synchronization Interrupt Enable Position */
#define ISI_IER_VSYNC_Msk                   (0x1U << ISI_IER_VSYNC_Pos)                    /**< (ISI_IER) Vertical Synchronization Interrupt Enable Mask */
#define ISI_IER_VSYNC                       ISI_IER_VSYNC_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IER_VSYNC_Msk instead */
#define ISI_IER_PXFR_DONE_Pos               16                                             /**< (ISI_IER) Preview DMA Transfer Done Interrupt Enable Position */
#define ISI_IER_PXFR_DONE_Msk               (0x1U << ISI_IER_PXFR_DONE_Pos)                /**< (ISI_IER) Preview DMA Transfer Done Interrupt Enable Mask */
#define ISI_IER_PXFR_DONE                   ISI_IER_PXFR_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IER_PXFR_DONE_Msk instead */
#define ISI_IER_CXFR_DONE_Pos               17                                             /**< (ISI_IER) Codec DMA Transfer Done Interrupt Enable Position */
#define ISI_IER_CXFR_DONE_Msk               (0x1U << ISI_IER_CXFR_DONE_Pos)                /**< (ISI_IER) Codec DMA Transfer Done Interrupt Enable Mask */
#define ISI_IER_CXFR_DONE                   ISI_IER_CXFR_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IER_CXFR_DONE_Msk instead */
#define ISI_IER_P_OVR_Pos                   24                                             /**< (ISI_IER) Preview Datapath Overflow Interrupt Enable Position */
#define ISI_IER_P_OVR_Msk                   (0x1U << ISI_IER_P_OVR_Pos)                    /**< (ISI_IER) Preview Datapath Overflow Interrupt Enable Mask */
#define ISI_IER_P_OVR                       ISI_IER_P_OVR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IER_P_OVR_Msk instead */
#define ISI_IER_C_OVR_Pos                   25                                             /**< (ISI_IER) Codec Datapath Overflow Interrupt Enable Position */
#define ISI_IER_C_OVR_Msk                   (0x1U << ISI_IER_C_OVR_Pos)                    /**< (ISI_IER) Codec Datapath Overflow Interrupt Enable Mask */
#define ISI_IER_C_OVR                       ISI_IER_C_OVR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IER_C_OVR_Msk instead */
#define ISI_IER_CRC_ERR_Pos                 26                                             /**< (ISI_IER) Embedded Synchronization CRC Error Interrupt Enable Position */
#define ISI_IER_CRC_ERR_Msk                 (0x1U << ISI_IER_CRC_ERR_Pos)                  /**< (ISI_IER) Embedded Synchronization CRC Error Interrupt Enable Mask */
#define ISI_IER_CRC_ERR                     ISI_IER_CRC_ERR_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IER_CRC_ERR_Msk instead */
#define ISI_IER_FR_OVR_Pos                  27                                             /**< (ISI_IER) Frame Rate Overflow Interrupt Enable Position */
#define ISI_IER_FR_OVR_Msk                  (0x1U << ISI_IER_FR_OVR_Pos)                   /**< (ISI_IER) Frame Rate Overflow Interrupt Enable Mask */
#define ISI_IER_FR_OVR                      ISI_IER_FR_OVR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IER_FR_OVR_Msk instead */
#define ISI_IER_MASK                        (0xF030406U)                                   /**< \deprecated (ISI_IER) Register MASK  (Use ISI_IER_Msk instead)  */
#define ISI_IER_Msk                         (0xF030406U)                                   /**< (ISI_IER) Register Mask  */
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */


/* -------- ISI_IDR : (ISI Offset: 0x30) (/W 32) ISI Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t :1;                        /**< bit:      0  Reserved */
    uint32_t DIS_DONE:1;                /**< bit:      1  Disable Done Interrupt Disable           */
    uint32_t SRST:1;                    /**< bit:      2  Software Reset Interrupt Disable         */
    uint32_t :7;                        /**< bit:   3..9  Reserved */
    uint32_t VSYNC:1;                   /**< bit:     10  Vertical Synchronization Interrupt Disable */
    uint32_t :5;                        /**< bit: 11..15  Reserved */
    uint32_t PXFR_DONE:1;               /**< bit:     16  Preview DMA Transfer Done Interrupt Disable */
    uint32_t CXFR_DONE:1;               /**< bit:     17  Codec DMA Transfer Done Interrupt Disable */
    uint32_t :6;                        /**< bit: 18..23  Reserved */
    uint32_t P_OVR:1;                   /**< bit:     24  Preview Datapath Overflow Interrupt Disable */
    uint32_t C_OVR:1;                   /**< bit:     25  Codec Datapath Overflow Interrupt Disable */
    uint32_t CRC_ERR:1;                 /**< bit:     26  Embedded Synchronization CRC Error Interrupt Disable */
    uint32_t FR_OVR:1;                  /**< bit:     27  Frame Rate Overflow Interrupt Disable    */
    uint32_t :4;                        /**< bit: 28..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_IDR_Type;
